### Imputacion de datos

import matplotlib.pyplot as plt

import numpy as np

import pandas as pd

import scipy as stat

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import scipy as stat

clientes = pd.read_csv("clientes.csv")

df_clientes

In [2]:
clientes_df = pd.read_excel('Dataset/clientes.xlsx')
clientes_df

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

### Buscar valores nulos

print(df_clientes['ingreso'].isnull())

In [7]:
print(clientes_df['ingreso'].isnull())

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8     True
Name: ingreso, dtype: bool

### Filtrar solo valores nulos

print(df_clientes[df_clientes["ingreso"].isnull()])

In [3]:
print(clientes_df[clientes_df["ingreso"].isnull()])

    nombre  edad  ingreso
4      NaN   NaN      NaN
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

### eliminar valores nulos a la mala

print(df_clientes.dropna())

print(df_clientes.dropna(subset=["edad","ingreso"]))

In [4]:
print(clientes_df.dropna(subset=['edad','ingreso']))

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
2     NaN  70.0  20000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

df_clientes2=pd.DataFrame.copy(df_clientes)

df_clientes2

In [5]:
clientes_df2 = pd.DataFrame.copy(clientes_df)

clientes_df2

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

df_clientes.dropna(subset=["ingreso"],inplace=True)

df_clientes

### rellenar con valor por defecto 0

print(df_clientes.fillna(0))

In [7]:
print(clientes_df2.fillna(1))

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        1  70.0  20000.0
3   Carmen  49.0  22000.0
4        1   1.0      1.0
5    Mario  30.0  15800.0
6    Pedro   1.0  17400.0
7  Gustavo  27.0      1.0
8   Carlos   1.0      1.0

### rellenar con valor por defecto "Desconocido" para los campos de texto

print(df_clientes["nombre"].fillna("Desconocido"))

In [9]:
print(clientes_df2['nombre'].fillna('Unknown'))

0       Juan
1      Luisa
2    Unknown
3     Carmen
4    Unknown
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

### Imputar valores por valores estadisticos

promedio=df_clientes2["edad"].mean()

mediana=df_clientes2["edad"].median()

moda=df_clientes2["edad"].mode()

print(promedio)

print(df_clientes2["edad"].fillna(promedio))

In [13]:
media = clientes_df2['edad'].mean()
#clientes_df2['edad'].fillna(media, inplace=True)
clientes_df2.fillna({'edad': media}, inplace=True)

print(media)

clientes_df2

39.333333333333336

    nombre       edad  ingreso
0     Juan  35.000000  15800.0
1    Luisa  25.000000  17000.0
2      NaN  70.000000  20000.0
3   Carmen  49.000000  22000.0
4      NaN  39.333333      NaN
5    Mario  30.000000  15800.0
6    Pedro  39.333333  17400.0
7  Gustavo  27.000000      NaN
8   Carlos  39.333333      NaN

In [14]:
clientes_df2.fillna({
    'edad': media,
    'ingreso': clientes_df2['ingreso'].mean()},
    inplace=True)

In [15]:
clientes_df2.describe()

            edad      ingreso
count   9.000000      9.00000
mean   39.333333  18000.00000
std    13.680887   1969.77156
min    25.000000  15800.00000
25%    30.000000  17000.00000
50%    39.333333  18000.00000
75%    39.333333  18000.00000
max    70.000000  22000.00000